# TrussElementEnd0Elevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussElementEnd0Elevation Property
ParameterTypeId Class See Also
---
"Start Level Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussElementEnd0Elevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussElementEnd0Elevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussElementEnd0Elevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace